# IsDGNExportAvailable Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
OptionalFunctionalityUtils..::..IsDGNExportAvailable Method
OptionalFunctionalityUtils Class See Also
---
Checks whether the DGN Export functionality is available in the installed Revit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static bool IsDGNExportAvailable()
```

Visual Basic
---
```text
Public Shared Function IsDGNExportAvailable As Boolean
```

Visual C++
---
```text
public:
static bool IsDGNExportAvailable()
```

# ### Return Value
True if the DGN Export functionality is available in the installed Revit.
# Remarks
DGN Export requires presence of certain modules that are optional and may not be part of the installed Revit.
# See Also
OptionalFunctionalityUtils Class
Autodesk.Revit.DB Namespace